import pytest

from ..pages.parametrize_page import TestParametrizePage

link = "https://www.ozon.ru/"


@pytest.mark.parametrize('string', [
    1, 0, -1, '@', '!@#$%^&*()', 'a', 'A', ' ', '1234567890098765432'
                                                '112345678900987654321123456789009876543211234567'
                                                '89009876543211234567890098765432112345678900987654'
                                                '32112345678900987654321123456789009876543211234567890'
                                                '098765432112345678900987654321123456789009876543211234567890098'
                                                '765432112345678900987654321123456789009876543211234567890098765432'
                                                '100000', '1234567890098765432'
                                                          '112345678900987654321123456789009876543211234567'
                                                          '098765432112345678900987654321123456789009876543211234567890098'
                                                          '765432112345678900987654321123456789009876543211234567890098765432'
                                                          '100000''1234567890098765432'
                                                          '100000', 'абвгдеёжзикклмнпрстофкцчшщьъэюя',
    '闩万乃厂亼巨水彐凵片人从卄囗冂尸匚丁丫中乂厶丩山刁扣习'
])
def test_checking_search_field(browser, string):
    page = TestParametrizePage(browser, link)
    page.open()
    page.checking_search_field()
    page.checking_parametrize_data(string)
